UB_Copy/src/InformationRegisters/УБ_ДанныеДляПодбораСотрудников/УБ_ДанныеДляПодбораСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УБ_ДанныеДляПодбораСотрудников</name>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.УБ_Подразделения</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>DefinedType.УБ_Должности</types>
    </type>
  </resources>
  <resources>
    <name>ДолжностьПоШтатномуРасписанию</name>
    <type>
      <types>DefinedType.УБ_ШтатноеРасписание</types>
    </type>
  </resources>
  <resources>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.УБ_ВидыКадровыхСобытий</types>
    </type>
  </resources>
  <resources>
    <name>Начало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Окончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПометкаУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Код</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>DefinedType.УБ_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЗаписи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UB_Copy/src/InformationRegisters/УБ_МоделиПланированияСотрудников/УБ_МоделиПланированияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УБ_МоделиПланированияСотрудников</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>МодельПланированияЭффективности</name>
    <type>
      <types>CatalogRef.УБ_МоделиПланированияЭффективности</types>
    </type>
  </resources>
  <resources>
    <name>Грейд</name>
    <type>
      <types>CatalogRef.УБ_Грейды</types>
    </type>
  </resources>
  <attributes>
    <name>ВидСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>DefinedType.УБ_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КадровыйДокумент</name>
    <type>
      <types>DocumentRef.КадровыйПереводСписком</types>
      <types>DocumentRef.ПриемНаРаботуСписком</types>
      <types>DocumentRef.КадровыйПеревод</types>
      <types>DocumentRef.УБ_НазначениеНаДолжность</types>
      <types>DocumentRef.УБ_ПереводНаДолжность</types>
      <types>DocumentRef.ПриемНаРаботу</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UB_Copy/src/InformationRegisters/УБ_ДоступностьРасчетаЭффективностиСотрудниковДляПользователей/УБ_ДоступностьРасчетаЭффективностиСотрудниковДляПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УБ_ДоступностьРасчетаЭффективностиСотрудниковДляПользователей</name>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.УБ_Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>DefinedType.УБ_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЗаписи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UB_Copy/src/InformationRegisters/УБ_НазначенныеРуководителиПодразделений/УБ_НазначенныеРуководителиПодразделений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УБ_НазначенныеРуководителиПодразделений</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Руководитель</name>
    <type>
      <types>DefinedType.УБ_Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтстранения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.УБ_Подразделения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UB_Copy/src/InformationRegisters/УБ_ДелегированныеСотрудникиПодразделения/УБ_ДелегированныеСотрудникиПодразделения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УБ_ДелегированныеСотрудникиПодразделения</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗаместительРуководителя</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>DefinedType.УБ_Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.УБ_ВидыОперацийДелегирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>DefinedType.УБ_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.УБ_Подразделения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UB_Copy/src/InformationRegisters/УБ_КадроваяИсторияСотрудников/УБ_КадроваяИсторияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УБ_КадроваяИсторияСотрудников</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.УБ_Подразделения</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>DefinedType.УБ_Должности</types>
    </type>
  </resources>
  <resources>
    <name>ДолжностьПоШтатномуРасписанию</name>
    <type>
      <types>DefinedType.УБ_ШтатноеРасписание</types>
    </type>
  </resources>
  <resources>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.УБ_ВидыКадровыхСобытий</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>DefinedType.УБ_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UB_Copy/src/Enums/УБ_ВидыОперацийДелегирования/УБ_ВидыОперацийДелегирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УБ_ВидыОперацийДелегирования</name>
  <enumValues>
    <name>ПодсистемаМотивации</name>
  </enumValues>
  <enumValues>
    <name>ПодсистемаПланирования</name>
  </enumValues>
</mdclass:Enum>

UB_Copy/src/Enums/УБ_ВидыКадровыхСобытий/УБ_ВидыКадровыхСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УБ_ВидыКадровыхСобытий</name>
  <enumValues>
    <name>Прием</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
  </enumValues>
</mdclass:Enum>

UB_Copy/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

UB_Copy/src/Catalogs/УБ_Сотрудники/УБ_Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УБ_Сотрудники</name>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УточнениеНаименования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

UB_Copy/src/CommonModules/УБ_ДоступностьРасчетаЭффективностиСотрудниковДляПользователей/Module.bsl
#Область ОбработчикиПодписокНаСобытия

Процедура УБ_ЗаполнитьДоступностьРасчетаЭффективностиСотрудников(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ФизическоеЛицоПредыдущее = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка, "ФизическоеЛицо");
	НедействителенПредыдущее = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка, "Недействителен");
	Если Источник.ЭтоНовый() Или ФизическоеЛицоПредыдущее <> Источник.ФизическоеЛицо
		Или НедействителенПредыдущее <> Источник.Недействителен Тогда
		Источник.ДополнительныеСвойства.Вставить("ДобавитьДанныеДоступностиНовогоПользователя", Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура УБ_ОбновитьДоступностьРасчетаЭффективностиСотрудников(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;                       	 
	
	Если Источник.ДополнительныеСвойства.Свойство("ДобавитьДанныеДоступностиНовогоПользователя") Тогда
		
		ТаблицаФильтр = ТаблицаФильтрДоступностиРасчетаЭффективности();
		
		СтрокаФильтра = ТаблицаФильтр.Добавить(); 	
		СтрокаФильтра.Пользователь = Источник.Ссылка; 			
		СтрокаФильтра.ФизическоеЛицо = Источник.ФизическоеЛицо;
		СтрокаФильтра.ДатаНачала = '00010101';
		СтрокаФильтра.ДатаОкончания = '39991231235959'; 
		
		ОбновитьРегистрДоступностьРасчетаЭффективностиСотрудников(ТаблицаФильтр);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УБ_ОбновитьДоступностьРасчетаЭффективностиПриИзмененииКадровойИстории(Источник, Отказ, Замещение) Экспорт
	
	ИзменившиесяДанныеКадровойИстории = Источник.ТаблицаИзменившихсяДанныхНабора();
	
	Если ИзменившиесяДанныеКадровойИстории = Неопределено
		Или ИзменившиесяДанныеКадровойИстории.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ФизическиеЛица = Новый Массив;
	
	Для Каждого СтрокаИзменений Из ИзменившиесяДанныеКадровойИстории Цикл
		Если ФизическиеЛица.Найти(СтрокаИзменений.ФизическоеЛицо) = Неопределено Тогда
			ФизическиеЛица.Добавить(СтрокаИзменений.ФизическоеЛицо);
		КонецЕсли;
	КонецЦикла;
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Пользователь,
	|	Пользователи.ФизическоеЛицо КАК ФизическоеЛицо
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.ФизическоеЛицо В (&ФизическиеЛица)";
	
	Запрос.УстановитьПараметр("ФизическиеЛица", ФизическиеЛица);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаПользователей = РезультатЗапроса.Выбрать();
	
	ТаблицаФильтр = ТаблицаФильтрДоступностиРасчетаЭффективности();
	
	Пока ВыборкаПользователей.Следующий() Цикл
		СтрокаФильтра = ТаблицаФильтр.Добавить(); 			
		СтрокаФильтра.Пользователь = ВыборкаПользователей.Пользователь;
		СтрокаФильтра.ФизическоеЛицо = ВыборкаПользователей.ФизическоеЛицо;
		СтрокаФильтра.ДатаНачала = '00010101';
		СтрокаФильтра.ДатаОкончания = '39991231235959';
	КонецЦикла;
	
 	ОбновитьРегистрДоступностьРасчетаЭффективностиСотрудников(ТаблицаФильтр);
	
КонецПроцедуры

Процедура УБ_ОбновитьДоступностьРасчетаЭффективностиПриИзмененииРуководителяПодразделения(Источник, Отказ, Замещение) Экспорт
	
	ИзменившиесяДанные = Источник.ТаблицаИзменившихсяДанныхНабора();
	Если ИзменившиесяДанные = Неопределено
		Или ИзменившиесяДанные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаФильтрРасчетаЭффективности = ТаблицаФильтрДоступностиРасчетаЭффективности();
	
	Если Тип(Источник) = Тип("РегистрСведенийНаборЗаписей.УБ_ДелегированныеСотрудникиПодразделения") Тогда 		
		МассивСтрокРасчетаЭффективности = ИзменившиесяДанные.НайтиСтроки(Новый Структура("ВидОперации", Перечисления.УБ_ВидыОперацийДелегирования.ПодсистемаМотивации));

		рэИзменившиесяДанные = ИзменившиесяДанные.Скопировать(МассивСтрокРасчетаЭффективности); 
		ЗаместителиРуководителей = рэИзменившиесяДанные.ВыгрузитьКолонку("СтароеЗначениеЗаместительРуководителя");

		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ЗаместителиРуководителей, рэИзменившиесяДанные.ВыгрузитьКолонку("НовоеЗначениеЗаместительРуководителя"), Истина);               

		Для Каждого ЗаместительРуководителя Из ЗаместителиРуководителей Цикл
			Если ЗначениеЗаполнено(ЗаместительРуководителя) Тогда
				СтрокаФильтра = ТаблицаФильтрРасчетаЭффективности.Добавить();
				СтрокаФильтра.Пользователь = ЗаместительРуководителя;
				СтрокаФильтра.ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаместительРуководителя,"ФизическоеЛицо"); 	
				СтрокаФильтра.ДатаНачала = '00010101';
				СтрокаФильтра.ДатаОкончания = '39991231235959';
			КонецЕсли;
		КонецЦикла;
		
	Иначе 		   
		ПользователиРуководителей = ИзменившиесяДанные.ВыгрузитьКолонку("СтароеЗначениеПользователь");
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПользователиРуководителей,
			ИзменившиесяДанные.ВыгрузитьКолонку("НовоеЗначениеПользователь"), Истина);

		Для Каждого Руководитель Из ПользователиРуководителей Цикл
			Если ЗначениеЗаполнено(Руководитель) Тогда
				СтрокаФильтра = ТаблицаФильтрРасчетаЭффективности.Добавить();
				СтрокаФильтра.Пользователь = Руководитель;
				СтрокаФильтра.ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Руководитель,"ФизическоеЛицо"); 	
				СтрокаФильтра.ДатаНачала = '00010101';
				СтрокаФильтра.ДатаОкончания = '39991231235959';
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
	ОбновитьРегистрДоступностьРасчетаЭффективностиСотрудников(ТаблицаФильтрРасчетаЭффективности);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПерезаполнитьДанныеРегистра() Экспорт
	
	ТаблицаФильтр = ТаблицаФильтрДоступностиРасчетаЭффективности();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Пользователь,
		|	Пользователи.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	НЕ Пользователи.Недействителен";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();	
	
	Пока Выборка.Следующий() Цикл 
		
		СтрокаФильтра = ТаблицаФильтр.Добавить(); 	
		СтрокаФильтра.Пользователь = Выборка.Пользователь;
		СтрокаФильтра.ФизическоеЛицо = Выборка.ФизическоеЛицо;
		СтрокаФильтра.ДатаНачала = '00010101';
		СтрокаФильтра.ДатаОкончания = '39991231235959'; 
		
	КонецЦикла;     	
	
	ОбновитьРегистрДоступностьРасчетаЭффективностиСотрудников(ТаблицаФильтр);
	
КонецПроцедуры

// возвращает предварительный текст запроса для динамического списка
// сотрудников
// например, может быть использован в форме УБ_ФормаВыбораСотрудника
// или при заполнении списков значений с отметками
&НаСервере
Функция ТекстЗапросаСписокСотрудников() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |	Сотрудники.Ссылка КАК Ссылка,
	 |	Сотрудники.Код КАК Код,
	 |	Сотрудники.Наименование КАК Наименование,
	 |	ДанныеДляПодбора.Наименование КАК НаименованиеСотрудника,
	 |	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	 |	Сотрудники.ГоловнаяОрганизация КАК Организация,
	 |	Сотрудники.ВАрхиве КАК ВАрхиве,
	 |	Сотрудники.УточнениеНаименования КАК УточнениеНаименования,
	 |	ДанныеДляПодбора.Подразделение КАК Подразделение,
	 |	ДанныеДляПодбора.Должность КАК Должность,
	 |	ДанныеДляПодбора.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию,
	 |	ДанныеДляПодбора.Начало КАК Начало,
	 |	ДанныеДляПодбора.Окончание КАК Окончание,
	 |	ЕСТЬNULL(МоделиПланированияСотрудников.МодельПланированияЭффективности, ЗНАЧЕНИЕ(Справочник.УБ_МоделиПланированияЭффективности.ПустаяСсылка)) КАК МодельПланированияЭффективности,
	 |	ЕСТЬNULL(МоделиПланированияСотрудников.Грейд, ЗНАЧЕНИЕ(Справочник.УБ_Грейды.ПустаяСсылка)) КАК Грейд,
	 |	ДанныеДляПодбора.ВидСобытия КАК ВидСобытия,
	 |	ВЫБОР
	 |		КОГДА ДанныеДляПодбора.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.УБ_ВидыКадровыхСобытий.Прием)
	 |				ИЛИ ДанныеДляПодбора.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.УБ_ВидыКадровыхСобытий.Перемещение)
	 |			ТОГДА ИСТИНА
	 |		ИНАЧЕ ЛОЖЬ
	 |	КОНЕЦ КАК ДействующийСотрудник
	 |ИЗ
	 |	РегистрСведений.УБ_ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УБ_Сотрудники КАК Сотрудники
	 |		ПО ДанныеДляПодбора.Сотрудник = Сотрудники.Ссылка
	 |			И ДанныеДляПодбора.Наименование = Сотрудники.Наименование
	 |			И (ДанныеДляПодбора.ИдентификаторЗаписи В
	 |				(ВЫБРАТЬ ПЕРВЫЕ 1
	 |					ДанныеДляПодбораСотрудниковОтбор.ИдентификаторЗаписи
	 |				ИЗ
	 |					РегистрСведений.УБ_ДанныеДляПодбораСотрудников КАК ДанныеДляПодбораСотрудниковОтбор
	 |				ГДЕ
	 |					ДанныеДляПодбораСотрудниковОтбор.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.УБ_ВидыКадровыхСобытий.Увольнение)
	 |					И ДанныеДляПодбораСотрудниковОтбор.Сотрудник = ДанныеДляПодбора.Сотрудник
	 |					И ДанныеДляПодбораСотрудниковОтбор.Наименование = ДанныеДляПодбора.Наименование
	 |					И ДанныеДляПодбораСотрудниковОтбор.Начало <= &ДатаОкончания
	 |					И (ДанныеДляПодбораСотрудниковОтбор.Окончание = ДАТАВРЕМЯ(1, 1, 1)
	 |						ИЛИ ДанныеДляПодбораСотрудниковОтбор.Окончание >= &ДатаНачала)
	 |				УПОРЯДОЧИТЬ ПО
	 |					ДанныеДляПодбораСотрудниковОтбор.Начало УБЫВ,
	 |					ДанныеДляПодбораСотрудниковОтбор.Организация,
	 |					ДанныеДляПодбораСотрудниковОтбор.Подразделение))
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УБ_МоделиПланированияСотрудников.СрезПоследних(
	 |				&ДатаНачала,
	 |				(Период, Сотрудник) В
	 |					(ВЫБРАТЬ
	 |						МАКСИМУМ(МоделиПланированияСотрудников.Период) КАК Период,
	 |						МоделиПланированияСотрудников.Сотрудник КАК Сотрудник
	 |					ИЗ
	 |						РегистрСведений.УБ_МоделиПланированияСотрудников.СрезПоследних(&ДатаНачала, ) КАК МоделиПланированияСотрудников
	 |					СГРУППИРОВАТЬ ПО
	 |						МоделиПланированияСотрудников.Сотрудник)) КАК МоделиПланированияСотрудников
	 |		ПО ДанныеДляПодбора.Сотрудник = МоделиПланированияСотрудников.Сотрудник
	 |			И (НЕ ДанныеДляПодбора.ДолжностьПоШтатномуРасписанию.Закрыта
	 |				ИЛИ &ДатаНачала < ДанныеДляПодбора.ДолжностьПоШтатномуРасписанию.ДатаЗакрытия)";
		
	Возврат ТекстЗапроса;

КонецФункции

&НаСервере
Функция ТекстОграниченияДоступаКСотрудникамРуководителя()  Экспорт
	
	ТекстОграничениеДоступа = 
		"ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УБ_ДоступностьРасчетаЭффективностиСотрудниковДляПользователей КАК ДоступностьРасчетаЭффективностиДляПользователей
		|		ПО (ДоступностьРасчетаЭффективностиДляПользователей.Пользователь = &ТекущийПользователь)
		|		И (ДоступностьРасчетаЭффективностиДляПользователей.Организация = ДанныеДляПодбора.Организация)
		|		И (ДоступностьРасчетаЭффективностиДляПользователей.Подразделение = ДанныеДляПодбора.Подразделение)
		|		И (ДоступностьРасчетаЭффективностиДляПользователей.ИдентификаторЗаписи В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ДоступностьРасчетаЭффективности.ИдентификаторЗаписи
		|			ИЗ
		|				РегистрСведений.УБ_ДоступностьРасчетаЭффективностиСотрудниковДляПользователей КАК ДоступностьРасчетаЭффективности
		|			ГДЕ
		|				ДоступностьРасчетаЭффективности.Пользователь = &ТекущийПользователь
		|				И ДоступностьРасчетаЭффективности.Подразделение = ДанныеДляПодбора.Подразделение
		|				И ВЫБОР
		|					КОГДА ДоступностьРасчетаЭффективности.Сотрудник = ЗНАЧЕНИЕ(Справочник.УБ_Сотрудники.ПустаяСсылка)
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ДоступностьРасчетаЭффективности.Сотрудник = ДанныеДляПодбора.Сотрудник
		|				КОНЕЦ
		|				И ДоступностьРасчетаЭффективности.ДатаНачала <= &ДатаОкончания
		|				И ВЫБОР
		|					КОГДА ДоступностьРасчетаЭффективности.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|						ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
		|					ИНАЧЕ ДоступностьРасчетаЭффективности.ДатаОкончания
		|				КОНЕЦ >= &ДатаНачала
		|			УПОРЯДОЧИТЬ ПО
		|				ДоступностьРасчетаЭффективности.Сотрудник))";
	
    	Возврат ТекстОграничениеДоступа;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТаблицаФильтрДоступностиРасчетаЭффективности()
	
	ТаблицаФильтр = Новый ТаблицаЗначений;
	ТаблицаФильтр.Колонки.Добавить("Пользователь", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	ТаблицаФильтр.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаФильтр.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата"));
	ТаблицаФильтр.Колонки.Добавить("ДатаОкончания", Новый ОписаниеТипов("Дата"));
	
	Возврат ТаблицаФильтр;
	
КонецФункции

Процедура ОбновитьРегистрДоступностьРасчетаЭффективностиСотрудников(ТаблицаФильтр)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаФильтр", ТаблицаФильтр);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаФильтр.Пользователь КАК Пользователь,
		|	ТаблицаФильтр.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ТаблицаФильтр.ДатаНачала КАК ДатаНачала,
		|	ТаблицаФильтр.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТТаблицаФильтр
		|ИЗ
		|	&ТаблицаФильтр КАК ТаблицаФильтр
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(НазначенныеРуководителиПодразделений.Период, ДЕНЬ) КАК НачалоПериода,
		|	КОНЕЦПЕРИОДА(НазначенныеРуководителиПодразделений.ДатаОтстранения, ДЕНЬ) КАК КонецПериода,
		|	НазначенныеРуководителиПодразделений.Организация КАК Организация,
		|	НазначенныеРуководителиПодразделений.Подразделение КАК Подразделение,
		|	ТаблицаФильтр.Пользователь КАК Пользователь,
		|	ЗНАЧЕНИЕ(Справочник.УБ_Сотрудники.ПустаяСсылка) КАК Сотрудник,
		|	ИСТИНА КАК ЭтоРуководитель,
		|	ЛОЖЬ КАК ЭтоДелегирование,
		|	ЛОЖЬ КАК ЭтоКадроваяИстория
		|ПОМЕСТИТЬ ВТКадроваяИсторияИРуководителиПодразделенийПериоды
		|ИЗ
		|	ВТТаблицаФильтр КАК ТаблицаФильтр
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УБ_НазначенныеРуководителиПодразделений КАК НазначенныеРуководителиПодразделений
		|		ПО ТаблицаФильтр.Пользователь = НазначенныеРуководителиПодразделений.Пользователь
		|			И (НазначенныеРуководителиПодразделений.Период >= НАЧАЛОПЕРИОДА(ТаблицаФильтр.ДатаНачала, ДЕНЬ))
		|			И (НазначенныеРуководителиПодразделений.Период <= ВЫБОР
		|				КОГДА ТаблицаФильтр.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
		|				ИНАЧЕ КОНЕЦПЕРИОДА(ТаблицаФильтр.ДатаОкончания, ДЕНЬ)
		|			КОНЕЦ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ДелегированныеСотрудникиПодразделения.Период, ДЕНЬ),
		|	КОНЕЦПЕРИОДА(ДелегированныеСотрудникиПодразделения.ДатаОкончания, ДЕНЬ),
		|	ДелегированныеСотрудникиПодразделения.Организация,
		|	ДелегированныеСотрудникиПодразделения.Подразделение,
		|	ТаблицаФильтр.Пользователь,
		|	ДелегированныеСотрудникиПодразделения.Сотрудник,
		|	ЛОЖЬ,
		|	ИСТИНА,
		|	ЛОЖЬ
		|ИЗ
		|	ВТТаблицаФильтр КАК ТаблицаФильтр
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УБ_ДелегированныеСотрудникиПодразделения КАК ДелегированныеСотрудникиПодразделения
		|		ПО ТаблицаФильтр.Пользователь = ДелегированныеСотрудникиПодразделения.ЗаместительРуководителя
		|			И (ДелегированныеСотрудникиПодразделения.Период >= НАЧАЛОПЕРИОДА(ТаблицаФильтр.ДатаНачала, ДЕНЬ))
		|			И (ДелегированныеСотрудникиПодразделения.Период <= ВЫБОР
		|				КОГДА ТаблицаФильтр.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
		|				ИНАЧЕ КОНЕЦПЕРИОДА(ТаблицаФильтр.ДатаОкончания, ДЕНЬ)
		|			КОНЕЦ)
		|ГДЕ
		|	ДелегированныеСотрудникиПодразделения.ВидОперации = &ВидОперации
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(КадроваяИсторияСотрудников.Период, ДЕНЬ),
		|	КОНЕЦПЕРИОДА(ТаблицаФильтр.ДатаОкончания, ДЕНЬ),
		|	КадроваяИсторияСотрудников.Организация,
		|	КадроваяИсторияСотрудников.Подразделение,
		|	ТаблицаФильтр.Пользователь,
		|	КадроваяИсторияСотрудников.Сотрудник,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ИСТИНА
		|ИЗ
		|	ВТТаблицаФильтр КАК ТаблицаФильтр
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УБ_КадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников
		|		ПО ТаблицаФильтр.ФизическоеЛицо = КадроваяИсторияСотрудников.ФизическоеЛицо
		|			И (КадроваяИсторияСотрудников.Период >= НАЧАЛОПЕРИОДА(ТаблицаФильтр.ДатаНачала, ДЕНЬ))
		|			И (КадроваяИсторияСотрудников.Период <= ВЫБОР
		|				КОГДА ТаблицаФильтр.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
		|				ИНАЧЕ КОНЕЦПЕРИОДА(ТаблицаФильтр.ДатаОкончания, ДЕНЬ)
		|			КОНЕЦ)
		|			И (КадроваяИсторияСотрудников.Подразделение <> ЗНАЧЕНИЕ(Справочник.УБ_Подразделения.ПустаяСсылка))
		|			И (КадроваяИсторияСотрудников.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.УБ_ВидыКадровыхСобытий.Увольнение))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(КадроваяИсторияИРуководители.НачалоПериода, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачала,
		|	КадроваяИсторияИРуководители.КонецПериода КАК ДатаОкончания,
		|	КадроваяИсторияИРуководители.Организация КАК Организация,
		|	КадроваяИсторияИРуководители.Подразделение КАК Подразделение,
		|	ЕСТЬNULL(КадроваяИсторияИРуководители.Сотрудник, ЗНАЧЕНИЕ(Справочник.УБ_Сотрудники.ПустаяСсылка)) КАК Сотрудник,
		|	ТаблицаФильтр.Пользователь КАК Пользователь,
		|	ЕСТЬNULL(КадроваяИсторияИРуководители.ЭтоРуководитель, ЛОЖЬ) КАК ЭтоРуководитель,
		|	ЕСТЬNULL(КадроваяИсторияИРуководители.ЭтоДелегирование, ЛОЖЬ) КАК ЭтоДелегирование,
		|	ЕСТЬNULL(КадроваяИсторияИРуководители.ЭтоКадроваяИстория, ЛОЖЬ) КАК ЭтоКадроваяИстория
		|ИЗ
		|	ВТТаблицаФильтр КАК ТаблицаФильтр
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадроваяИсторияИРуководителиПодразделенийПериоды КАК КадроваяИсторияИРуководители
		|		ПО ТаблицаФильтр.Пользователь = КадроваяИсторияИРуководители.Пользователь
		|
		|УПОРЯДОЧИТЬ ПО
		|	Пользователь,
		|	Организация,
		|	Сотрудник,
		|	ДатаНачала
		|ИТОГИ ПО
		|	Пользователь,
		|	Организация,
		|	Сотрудник";
	
	УБ_ОбщегоНазначения.СкорректироватьТекстЗапросаПодТекущуюКонфигурацию(Запрос.Текст);
	
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.УБ_ВидыОперацийДелегирования.ПодсистемаМотивации);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПользователи = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Пользователь");
	
	Пока ВыборкаПользователи.Следующий() Цикл

		НаборЗаписей = РегистрыСведений.УБ_ДоступностьРасчетаЭффективностиСотрудниковДляПользователей.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Пользователь.Установить(ВыборкаПользователи.Пользователь);
		
		ВыборкаОрганизации = ВыборкаПользователи.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Организация");
		Пока ВыборкаОрганизации.Следующий() Цикл
			
			ВыборкаСотрудники = ВыборкаОрганизации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Сотрудник");
			Пока ВыборкаСотрудники.Следующий() Цикл
				
				ПредыдущаяСтрокаКадровойИстории = Неопределено;
				
				ВыборкаДетальныеЗаписи = ВыборкаСотрудники.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					Если ВыборкаДетальныеЗаписи.ЭтоРуководитель Тогда
		
					КонецЕсли;
					
					Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаНачала) Тогда
						Продолжить;
					КонецЕсли;
					
					Если ВыборкаДетальныеЗаписи.ЭтоКадроваяИстория Тогда
						
						Если ПредыдущаяСтрокаКадровойИстории = Неопределено
							Или ПредыдущаяСтрокаКадровойИстории.Подразделение <> ВыборкаДетальныеЗаписи.Подразделение Тогда
							
							Если ПредыдущаяСтрокаКадровойИстории <> Неопределено Тогда
								ПредыдущаяСтрокаКадровойИстории.ДатаОкончания = НачалоДня(ВыборкаДетальныеЗаписи.ДатаНачала) - 1;
							КонецЕсли;
							
							СтрокаНабора = НаборЗаписей.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаНабора, ВыборкаДетальныеЗаписи);
							
							СтрокаНабора.ИдентификаторЗаписи = Новый УникальныйИдентификатор;
							
							ПредыдущаяСтрокаКадровойИстории = СтрокаНабора;
							
						КонецЕсли;
						
					Иначе
						
						СтрокаНабора = НаборЗаписей.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаНабора, ВыборкаДетальныеЗаписи);
						
						СтрокаНабора.ИдентификаторЗаписи = Новый УникальныйИдентификатор;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
		НаборЗаписей.Записать();

	КонецЦикла;

КонецПроцедуры

#КонецОбласти
